Repository: efl-dev/enventor
Catalog: po/*.po
Languages: ru

source: Failed to generate tmp folder!
ru: Невозможно создать временную директорию!

source: Cannot create a config folder "%s"
ru: Невозможно создать директорию с конфигурационными файлами. "%s"

source: Cannot save a config file "%s"
ru: Неудалось сохранить файл настроек "%s"

source: Cannot load a config file "%s"
ru: Неудалось загрузить настройки из файла "%s"

source: Failed to allocate Memory!
ru: Ошибка выделения памяти!

source: EDC has been changed on the file system.
ru: EDC-файл был изменен друшим приложением.

source: Do you want to replace the contents?
ru: Вы уверенны, что хотите заменить файл?

source: Save As
ru: Сохранить как

source: Replace
ru: Замена

source: Ignore
ru: Пропустить

source: File saved. "%s"
ru: Файл сохранен. "%s"

source: Already saved. "%s"
ru: Сохранен. "%s"

source: Invalid line number
ru: Неверный номер строки.

source: Enventor Goto Line
ru: Enventor Перейти к строке

source: Go to Line
ru: Перейти к строке

source: Enter line number [1..%d]:
ru: Введите номер строки [1..%d]:

source: Ok
ru: Перейти

source: Failed to grab key - Escape
ru: Ошибка перехвата нажатия - Escape

source: Double click the part to confirm.
ru: Сделайте двойной клик мыши по примитиву для вставки.

source: Faild to allocate Memory!
ru: Ошибка выделения памяти!

source: Auto Completion Enabled.
ru: Автодополнение Включено.

source: Auto Completion Disabled.
ru: Автодополнение Выключенно

source: Auto Indentation Enabled.
ru: Автовыравнивание Включено

source: Auto Indentation Disabled.
ru: Автовыравнивание Выключено

source: Font Size: %1.1fx
ru: Размер шрифта: %1.1fx

source: Program Run: "%s"
ru: Запущена программа: "%s"

source: Insertion of template code is disabled while in Live Edit mode
ru: Невозможно вставить шаблон, пока активен режим Live Edit

source: Template code inserted, (%s)
ru: Шаблон вставлен, (%s)

source: Can't insert template code here. Move the cursor inside the "Collections,Images,Parts,Part,Programs" scope.
ru: Невозможно втавить шаблон в это место. Переместите курсор внутрь одного из блоков: "Collections, Images,Parts,Part,Programs"

source: Failed to grab key - %s
ru: Ошибка перехвата клавиши - %s

source: New File: Choose a template
ru: Новый файл: Выберите шаблон

source: Cancel
ru: Отмена

source: Without save, you will lose last changes!
ru: Без сохранения все изменения будут утеряны!

source: Will you save changes?
ru: Сохранить изменения?

source: Save
ru: Сохранить

source: Discard
ru: Не сохранять

source: Choose a file to save
ru: Выбирете файл для сохранения

source: Failed to save: %s.
ru: Неудалось сохранить: %s.

source: Support only .edc file.
ru: Поддерживаются файлы с расширением .edc.

source: Choose a file to load.
ru: Выбирете файл для загрузки.

source: Failed to load: %s.
ru: Невозможно загрузить: %s.

source: Save File: Choose a EDC
ru: Сохранение: Выберите .edc файл

source: Close
ru: Закрыть

source: Load File: Choose a EDC
ru: Загрузка: Выберите .edc файл

source: Load
ru: Загрузить

source: New
ru: Новый

source: Settings
ru: Настройки

source: About
ru: Помощь

source: Exit
ru: Выход

source: Close Enventor Menu (Esc)
ru: Закрыть меню (Esc)

source: Cannot find file! "%s"
ru: Неудалось найти файл! "%s"

source: Cannot find templates folder! "%s"
ru: Неудалось найди директорию с шаблонами! "%s"

source: %d matches replaced
ru: %d совпадений заменено.

source: No "%s" in the text
ru: Строка "%s" не найдена

source: Backward
ru: Назад

source: Forward
ru: Вперед

source: Enventor Search
ru: Поиск

source: Find/Replace
ru: Поиск/Замена

source: Replace All
ru: Заменить все совпадения

source: Image Paths:
ru: Изображения:

source: Sound Paths:
ru: Звуки:

source: Font Paths:
ru: Шрифты:

source: Data Paths:
ru: Данные:

source: Preferences:
ru: Дополнительные настройки:

source: Live View Scale
ru: Масштаб Live View

source: Live View Size
ru: размер Live View

source: Part Highlighting
ru: Подсветка примитивов

source: Dummy Parts
ru: Изображение для контейнеров

source: Status
ru: Строка статуса

source: Tools
ru: Меню инструментов

source: Auto Hiding Console
ru: Авто скрытие консоли

source: General
ru: Общие

source: Text Editor
ru: Текст

source: Apply
ru: Применить

source: Reset
ru: Сбросить

source: Failed to open file "%s"
ru: Неудалось открыть файл "%s"

source: Double click a keyword to change its color :
ru: Двойной клик по слову позволит задать цвет:

source: Font Size
ru: Размер шрифта

source: Line Number
ru: Номера строк

source: Auto Indentation
ru: Автовыравнивание

source: Auto Completion
ru: Автодополнений

source: Font Name
ru: Имя шрифта

source: Font Style
ru: Стиль шрифта

source: Redo text.
ru: Восстановить изменения

source: No text to be redo.
ru: Нет действий для восстановления

source: Undo text.
ru: Отменить изменения

source: No text to be undo.
ru: Нет изменений для отмены

source: Enventor Menu (Esc)
ru: Меню (Esc)

source: Save File (Ctrl + S)
ru: Сохранить (Ctrl + S)

source: Undo Text (Ctrl + Z)
ru: Отменить (Ctrl + Z)

source: Redo Text (Ctrl + R)
ru: Повторить (Ctrl + R)

source: Find/Replace (Ctrl + F)
ru: Поиск/Замена (Ctrl + F)

source: Goto Lines (Ctrl + L)
ru: Перейти к строке (Ctrl + L)

source: Line Numbers (F5)
ru: Номера строк (F5)

source: Part Highlighting (Ctrl + H)
ru: Подсветка примитивов (Ctrl + H)

source: Dummy Parts (Ctrl + W)
ru: Изображение для контейнеров (Ctrl + W)

source: Live View Edit (Ctrl + E)
ru: Режим Live View (Ctrl + E)

source: Console Box (Alt + Down)
ru: Показать/Скрыть консоль (Alt + Down)

source: Status (F11)
ru: Строка статуса (F11)

source: Part Highlighting Enabled.
ru: Подсветка примитивов Включена

source: Part Highlighting Disabled.
ru: Подсветка примитивов Выключена

source: Dummy Parts Enabled.
ru: Изображение для контейнеров Включено

source: Dummy Parts Disabled.
ru: Изображения для контейнеров Выключено
